Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetWindowType
Gets the analytic window type this opening is associated with. Null when this opening is not a window.
Returns:
The analytic window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetConstruction
Gets the analytic construction this opening is associated with. Null when this opening is a window.
Returns:
The analytic construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this opening.
Remarks:
This unique id can be passed to the Document.GetElement(string) method.
If the originating element belongs to a linked document, the unique id of the link obtained from CADLinkUniqueId should be used to access it.
CADObjectUniqueId is unrelated to the CADObjectId element in gbxml.
Since:
2012